0529 회사 데이터프레임 합치는 작업 간소화 ipynb

In [30]:
import pandas as pd

In [31]:
def change_columns(data):

    col1=data.columns[-1:].to_list()
    col2=data.columns[:-1].to_list()

    new_col=col1+col2

    data = data[new_col]
    return data

In [41]:
data1 = pd.read_excel("220530_2022 서베이링크 패널 프로파일 조사_중간.xlsx")

In [44]:
data2 = pd.read_excel("220524_2022 서베이링크 패널 프로파일 조사_중간(통합).xlsx")

In [45]:
data2.columns

Index(['UID', 'TYPE', 'ATYPE', 'BTYPE', 'CTYPE', 'AQ1', 'AQ2', 'AQ2_1',
       'AQ2_R', 'AQ3',
       ...
       'CQ22_1#1', 'CQ22_1#2', 'CQ22_1#3', 'CQ22_1#4', 'CQ22_1#5', 'CQ22_1#6',
       'CQ22_1#7', 'CQ22_1#8', 'CQ22_2', 'CQ22_3'],
      dtype='object', length=818)

In [46]:
data1.columns

Index(['UID', 'TYPE', 'Atype', 'Btype', 'Ctype', 'AQ1', 'AQ2', 'AQ2_1',
       'AQ2_R', 'AQ3',
       ...
       'CQ22_1#1', 'CQ22_1#2', 'CQ22_1#3', 'CQ22_1#4', 'CQ22_1#5', 'CQ22_1#6',
       'CQ22_1#7', 'CQ22_1#8', 'CQ22_2', 'CQ22_3'],
      dtype='object', length=818)

In [47]:
data1.columns = data2.columns

In [48]:
merge_outer = pd.merge(data1,data2, how='outer',on='UID', suffixes=("_data1", "_data2"))

In [49]:
print(merge_outer.head(6))
print(merge_outer.shape)

                    UID  TYPE_data1 ATYPE_data1 BTYPE_data1 CTYPE_data1  \
0  20110822Bx8211000038         1.0           A           B           C
1  20110822Jc1312000164         1.0           A           B           C
2  20110823La3364000128         1.0           A           B           C
3  20110823Mu1559000201         1.0           A           B           C
4  20110826Ti8194000024         1.0           A           B           C
5  20110907Ea5005000214         1.0           A           B           C

   AQ1_data1  AQ2_data1  AQ2_1_data1  AQ2_R_data1  AQ3_data1  ...  \
0        2.0     1964.0         58.0          6.0        1.0  ...
1        1.0     1972.0         50.0          6.0        1.0  ...
2        1.0     1980.0         42.0          5.0        1.0  ...
3        2.0     1984.0         38.0          4.0        1.0  ...
4        2.0     1972.0         50.0          6.0        2.0  ...
5        2.0     1987.0         35.0          4.0        1.0  ...

   CQ22_1#1_data2  CQ22_1#2_data2  CQ22_1#3_data2  CQ22_1#4_data2  \
0             NaN             NaN             NaN             NaN
1             NaN             NaN             NaN             NaN
2             NaN             NaN             NaN             NaN
3             NaN             NaN             NaN             NaN
4             NaN             NaN             NaN             NaN
5             NaN             NaN             NaN             NaN

   CQ22_1#5_data2  CQ22_1#6_data2  CQ22_1#7_data2  CQ22_1#8_data2  \
0             NaN             NaN             NaN             NaN
1             NaN             NaN             NaN             NaN
2             NaN             NaN             NaN             NaN
3             NaN             NaN             NaN             NaN
4             NaN             NaN             NaN             NaN
5             NaN             NaN             NaN             NaN

   CQ22_2_data2  CQ22_3_data2
0           NaN           NaN
1           NaN           NaN
2           NaN           NaN
3           NaN           NaN
4           NaN           NaN
5           NaN           NaN

[6 rows x 1635 columns]
(2328, 1635)

In [50]:
table1 = pd.DataFrame()
table2 = pd.DataFrame()


for i in range(0, len(merge_outer.columns)):
    if "data1" in merge_outer.columns[i]:
        table1 = pd.concat([table1, merge_outer[merge_outer.columns[i]]], axis=1)
    if "data2" in merge_outer.columns[i]:
        table2 = pd.concat([table2, merge_outer[merge_outer.columns[i]]], axis=1)

In [51]:
# 원본 데이터 살리기
table1_dummy = table1.copy()
table2_dummy = table2.copy()

In [52]:
table1 = table1_dummy.copy()
table2 = table2_dummy.copy()

In [53]:
table1.head(1)

,TYPE_data1,ATYPE_data1,BTYPE_data1,CTYPE_data1,AQ1_data1,AQ2_data1,AQ2_1_data1,AQ2_R_data1,AQ3_data1,AQ4_data1,...,CQ22_1#1_data1,CQ22_1#2_data1,CQ22_1#3_data1,CQ22_1#4_data1,CQ22_1#5_data1,CQ22_1#6_data1,CQ22_1#7_data1,CQ22_1#8_data1,CQ22_2_data1,CQ22_3_data1
0,1.0,A,B,C,2.0,1964.0,58.0,6.0,1.0,3.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [54]:
table1.shape, merge_outer.shape

((2328, 817), (2328, 1635))

In [55]:
merge_outer.head()

,UID,TYPE_data1,ATYPE_data1,BTYPE_data1,CTYPE_data1,AQ1_data1,AQ2_data1,AQ2_1_data1,AQ2_R_data1,AQ3_data1,...,CQ22_1#1_data2,CQ22_1#2_data2,CQ22_1#3_data2,CQ22_1#4_data2,CQ22_1#5_data2,CQ22_1#6_data2,CQ22_1#7_data2,CQ22_1#8_data2,CQ22_2_data2,CQ22_3_data2
0,20110822Bx8211000038,1.0,A,B,C,2.0,1964.0,58.0,6.0,1.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,20110822Jc1312000164,1.0,A,B,C,1.0,1972.0,50.0,6.0,1.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,20110823La3364000128,1.0,A,B,C,1.0,1980.0,42.0,5.0,1.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,20110823Mu1559000201,1.0,A,B,C,2.0,1984.0,38.0,4.0,1.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,20110826Ti8194000024,1.0,A,B,C,2.0,1972.0,50.0,6.0,2.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [56]:
table1 = pd.concat([table1,merge_outer['UID']], axis=1, ignore_index=True)
table2 = pd.concat([table2,merge_outer['UID']], axis=1, ignore_index=True)

In [57]:
merge_outer['UID'].head(1)

0    20110822Bx8211000038
Name: UID, dtype: object

In [58]:
table1.head(1)

,0,1,2,3,4,5,6,7,8,9,...,808,809,810,811,812,813,814,815,816,817
0,1.0,A,B,C,2.0,1964.0,58.0,6.0,1.0,3.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,20110822Bx8211000038

In [59]:
# 컬럼 위치 바꾸기 -- 0529 수정
table1 = change_columns(table1)
table2 = change_columns(table2)

In [60]:
table1.columns = data1.columns
table2.columns = data2.columns

In [61]:
table1.update(table2,overwrite=False)

In [62]:
table1.to_csv("result.csv")